app/controllers/application_controller.rb

  def require_cat_owner!
   redirect_to cats_url unless current_user.cats.pluck(:id).include?(params[:id].to_i)
---
SELECT "cats"."id" FROM "cats" WHERE "cats"."user_id" = $1  [["user_id", 8]]