app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "end_date", "start_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["end_date", "2018-08-31"], ["start_date", "2018-08-09"], ["status", "PENDING"], ["created_at", "2018-08-15 20:04:55.199953"], ["updated_at", "2018-08-15 20:04:55.199953"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1  [["id", 1]]
---
  def current_cat_rental_request
    @rental_request ||=
      CatRentalRequest.includes(:cat).find(params[:id])