app/controllers/users_controller.rb

INSERT INTO "users" ("password_digest", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["password_digest", "$2a$10$WKSVrxwc6PmJyNOEN.ZUbOpCbCVJ8rS5PihZXmYJXs1Hq9QWU/ZVi"], ["created_at", "2018-08-15 18:37:41.178325"], ["updated_at", "2018-08-15 18:37:41.178325"]]
---
  def create
    @user = User.new(user_params)
    if @user.save