app/views/cats/_req_tr.html.erb

  <td><%= req.end_date %></td>
  <td><%= User.find(req.user_id).username %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]