app/views/cats/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---

      <td><%= attr_name == :user_id ? User.find(@cat.user_id).username : @cat.send(attr_name) %></td>

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 1]]
---
  </tr>
  <% @cat.rental_requests.order('start_date').each do |req| %>